xml-converter/xml-parser/test-data/ProjectsByCompanyIDBulkResponse_In.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns="http://rws.nl/ProjectsByCompany/1.0">
   <soapenv:Header/>
   <soapenv:Body>
      <ns:WS_ProjectsByCompanyID>
         <ProjectsByCompanyIDBulkResponseMessage>
            <Project_ProjectsByCompanyIDBulkResponseMessage>
               <!--Zero or more repetitions:-->
               <Project>
                  <_ID>?</_ID>
                  <Description>?</Description>
                  <CompanyID>?</CompanyID>
                  <PlantID>?</PlantID>
                  <WorkBreakdownStructureElement>?</WorkBreakdownStructureElement>
                  <Activity_Project>
                     <!--Zero or more repetitions:-->
                     <Activity>
                        <_ID>?</_ID>
                        <Description>?</Description>
                        <CompanyID>?</CompanyID>
                        <ParentNetworkID>?</ParentNetworkID>
                        <ParentWorkBreakdownStructureElementID>?</ParentWorkBreakdownStructureElementID>
                        <CostElementID>?</CostElementID>
                        <PlantID>?</PlantID>
                     </Activity>
                  </Activity_Project>
                  <WorkBreakdownStructureElement_Project>
                     <!--Zero or more repetitions:-->
                     <WorkBreakdownStructureElement>
                        <_ID>?</_ID>
                        <Description>?</Description>
                        <CompanyID>?</CompanyID>
                        <PlantID>?</PlantID>
                        <ResponsibleCostCenter>?</ResponsibleCostCenter>
                        <WorkBreakdownStructureElement_HierarchyRelationship_WBS>
                           <!--Optional:-->
                           <HierarchyRelationshipWBS>
                              <ParentWorkbreakDownStructureElementID>?</ParentWorkbreakDownStructureElementID>
                           </HierarchyRelationshipWBS>
                        </WorkBreakdownStructureElement_HierarchyRelationship_WBS>
                        <ResponsibleEmployee_WorkBreakdownStructureElement>
                           <!--Zero or more repetitions:-->
                           <ResponsibleEmployee>
                              <_ID>?</_ID>
                              <FormatedName>?</FormatedName>
                           </ResponsibleEmployee>
                        </ResponsibleEmployee_WorkBreakdownStructureElement>
                        <RequesterEmployee_WorkBreakdownStructureElement>
                           <!--Zero or more repetitions:-->
                           <RequesterEmployee>
                              <_ID>?</_ID>
                              <FormatedName>?</FormatedName>
                           </RequesterEmployee>
                        </RequesterEmployee_WorkBreakdownStructureElement>
                     </WorkBreakdownStructureElement>
                  </WorkBreakdownStructureElement_Project>
                  <Network_Project>
                     <!--Zero or more repetitions:-->
                     <Network>
                        <_ID>?</_ID>
                        <Description>?</Description>
                        <CompanyID>?</CompanyID>
                        <ParentWorkBreakdownStructureElementID>?</ParentWorkBreakdownStructureElementID>
                        <HierarchyRelationship_Network>
                           <!--Optional:-->
                           <HierarchyRelationshipNetwork>
                              <ParentNetworkID>?</ParentNetworkID>
                              <ParentActivityID>?</ParentActivityID>
                           </HierarchyRelationshipNetwork>
                        </HierarchyRelationship_Network>
                     </Network>
                  </Network_Project>
               </Project>
            </Project_ProjectsByCompanyIDBulkResponseMessage>
         </ProjectsByCompanyIDBulkResponseMessage>
      </ns:WS_ProjectsByCompanyID>
   </soapenv:Body>
</soapenv:Envelope>